TRAINING_MENU_BUTTON = "🏅 Тренування"
NOTIFICATIONS_MENU_BUTTON = "🔔 Сповіщення"
REPORT_PROBLEM_BUTTON = "❗️ Повідомити про проблему"
CONTINUE_MORNING_QUIZ_BUTTON = "📝 Продовжити ранкове опитування"

INTRO_MESSAGE = (
    "Ласкаво прошу до бота! (Тут має бути якийсь невеличкий опис)\n"
)

MORNING_NOTIFICATION_TIME_MESSAGE = (
    "Дякую, {name}! Тепер налаштуємо сповіщення. "
    "Введіть бажаний час для ранкового сповіщення. Його потрібно увести в форматі '08:00'. "
    "Введіть будь-який зручний час в рамках від 06:00 до 12:00!"
)



MORNING_NOTIFICATION_SETTINGS_FINISHED = (
    "Супер! Налаштування завершено! Тепер очікуй від бота сповіщень у вказаний час!"
)

CREATE_NEW_NOTIFICATION_BUTTON = "🆕 Створити нове сповіщення"
VIEW_NOTIFICATIONS_BUTTON = "📜 Переглянути сповіщення"
BACK_TO_MAIN_MENU_BUTTON = "↩️ Повернутися до головного меню"

BACK_BUTTON = "↩️ Назад"

NOTIFICATIONS_MENU = "🔔 Меню сповіщень"


WEEKDAYS = {
    "Пн": 0,
    "Вт": 1,
    "Ср": 2,
    "Чт": 3,
    "Пт": 4,
    "Сб": 5,
    "Нд": 6,
}

MONTHDAYS = {
    "1": 1,
    "2": 2,
    "3": 3,
    "4": 4,
    "5": 5,
    "6": 6,
    "7": 7,
    "8": 8,
    "9": 9,
    "10": 10,
    "11": 11,
    "12": 12,
    "13": 13,
    "14": 14,
    "15": 15,
    "16": 16,
    "17": 17,
    "18": 18,
    "19": 19,
    "20": 20,
    "21": 21,
    "22": 22,
    "23": 23,
    "24": 24,
    "25": 25,
    "26": 26,
    "27": 27,
    "28": 28,
    "29": 29,
    "30": 30,
    "31": 31,
}

frequency_options = {
    "freq_daily": "Щодня",
    "freq_weekly": "Щотижня",
    "freq_monthly": "Щомісяця",
    "freq_custom": "Власний розклад",
}


START_TRAINING_BUTTON = "🏋️‍♂️ Почати тренування"
